experiments/results/baseline-jaeger/raw/20260623_224524_read-home-timeline_R600_t4_c40_d60.txt
# workload=read-home-timeline
# rate=600
# threads=4
# connections=40
# duration=60
# timestamp=20260623_224524

Running 1m test @ http://localhost:8080/wrk2-api/home-timeline/read
  4 threads and 40 connections

  Thread calibration: mean lat.: 164.745ms, rate sampling interval: 910ms
  Thread calibration: mean lat.: 193.712ms, rate sampling interval: 1209ms
  Thread calibration: mean lat.: 195.416ms, rate sampling interval: 1240ms
  Thread calibration: mean lat.: 84.747ms, rate sampling interval: 525ms

-----------------------------------------------------------------------
Test Results @ http://localhost:8080/wrk2-api/home-timeline/read 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     6.18ms    6.10ms  32.16ms   92.04%
    Req/Sec   148.72     14.21   183.00     70.87%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    4.34ms
 75.000%    5.88ms
 90.000%   10.55ms
 99.000%   32.16ms
 99.900%   71.68ms
 99.990%  116.29ms
 99.999%  135.42ms
100.000%  135.42ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       2.249     0.000000            1         1.00
       3.303     0.100000         2993         1.11
       3.535     0.200000         5984         1.25
       3.767     0.300000         8984         1.43
       4.031     0.400000        11936         1.67
       4.343     0.500000        14923         2.00
       4.531     0.550000        16432         2.22
       4.747     0.600000        17921         2.50
       5.015     0.650000        19406         2.86
       5.375     0.700000        20879         3.33
       5.879     0.750000        22371         4.00
       6.215     0.775000        23123         4.44
       6.623     0.800000        23864         5.00
       7.183     0.825000        24608         5.71
       7.867     0.850000        25353         6.67
       8.927     0.875000        26099         8.00
       9.711     0.887500        26475         8.89
      10.559     0.900000        26845        10.00
      11.607     0.912500        27218        11.43
      12.815     0.925000        27590        13.33
      14.319     0.937500        27962        16.00
      15.191     0.943750        28149        17.78
      16.127     0.950000        28335        20.00
      17.295     0.956250        28524        22.86
      18.559     0.962500        28708        26.67
      20.223     0.968750        28894        32.00
      21.119     0.971875        28988        35.56
      22.191     0.975000        29081        40.00
      23.871     0.978125        29174        45.71
      25.487     0.981250        29267        53.33
      27.423     0.984375        29360        64.00
      29.007     0.985938        29407        71.11
      29.903     0.987500        29456        80.00
      31.535     0.989062        29500        91.43
      33.183     0.990625        29547       106.67
      35.647     0.992188        29593       128.00
      36.863     0.992969        29618       142.22
      38.367     0.993750        29640       160.00
      40.063     0.994531        29663       182.86
      42.431     0.995313        29687       213.33
      44.991     0.996094        29710       256.00
      46.751     0.996484        29722       284.44
      47.999     0.996875        29733       320.00
      50.175     0.997266        29745       365.71
      52.831     0.997656        29757       426.67
      58.335     0.998047        29768       512.00
      60.383     0.998242        29774       568.89
      61.151     0.998437        29780       640.00
      62.783     0.998633        29786       731.43
      67.775     0.998828        29792       853.33
      72.191     0.999023        29797      1024.00
      76.479     0.999121        29800      1137.78
      76.927     0.999219        29804      1280.00
      78.015     0.999316        29806      1462.86
      79.231     0.999414        29809      1706.67
      81.791     0.999512        29812      2048.00
      82.111     0.999561        29813      2275.56
      87.167     0.999609        29815      2560.00
      89.855     0.999658        29816      2925.71
      96.575     0.999707        29818      3413.33
      96.959     0.999756        29819      4096.00
      98.815     0.999780        29820      4551.11
     104.511     0.999805        29821      5120.00
     104.511     0.999829        29821      5851.43
     111.551     0.999854        29822      6826.67
     116.287     0.999878        29823      8192.00
     116.287     0.999890        29823      9102.22
     122.303     0.999902        29824     10240.00
     122.303     0.999915        29824     11702.86
     122.303     0.999927        29824     13653.33
     132.479     0.999939        29825     16384.00
     132.479     0.999945        29825     18204.44
     132.479     0.999951        29825     20480.00
     132.479     0.999957        29825     23405.71
     132.479     0.999963        29825     27306.67
     135.423     0.999969        29826     32768.00
     135.423     1.000000        29826          inf
#[Mean    =        6.178, StdDeviation   =        6.100]
#[Max     =      135.296, Total count    =        29826]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  35818 requests in 1.00m, 496.63MB read
Requests/sec:    596.85  
Transfer/sec:      8.28MB

# docker compose ps
NAME                                     IMAGE                                                COMMAND                  SERVICE                  CREATED        STATUS             PORTS
socialnetwork-compose-post-service-1     deathstarbench/social-network-microservices:latest   "ComposePostService"     compose-post-service     11 hours ago   Up About an hour   
socialnetwork-home-timeline-redis-1      redis                                                "docker-entrypoint.s…"   home-timeline-redis      11 hours ago   Up About an hour   6379/tcp
socialnetwork-home-timeline-service-1    deathstarbench/social-network-microservices:latest   "HomeTimelineService"    home-timeline-service    11 hours ago   Up About an hour   
socialnetwork-jaeger-agent-1             jaegertracing/all-in-one:1.62.0                      "/go/bin/all-in-one-…"   jaeger-agent             11 hours ago   Up About an hour   4317-4318/tcp, 5775/udp, 5778/tcp, 9411/tcp, 14250/tcp, 14268/tcp, 6831-6832/udp, 0.0.0.0:16686->16686/tcp, [::]:16686->16686/tcp
socialnetwork-media-frontend-1           yg397/media-frontend:xenial                          "/usr/local/openrest…"   media-frontend           11 hours ago   Up About an hour   0.0.0.0:8081->8080/tcp, [::]:8081->8080/tcp
socialnetwork-media-memcached-1          memcached                                            "docker-entrypoint.s…"   media-memcached          11 hours ago   Up About an hour   11211/tcp
socialnetwork-media-mongodb-1            mongo:4.4.6                                          "docker-entrypoint.s…"   media-mongodb            11 hours ago   Up About an hour   27017/tcp
socialnetwork-media-service-1            deathstarbench/social-network-microservices:latest   "MediaService"           media-service            11 hours ago   Up About an hour   
socialnetwork-nginx-thrift-1             yg397/openresty-thrift:xenial                        "/usr/local/openrest…"   nginx-thrift             11 hours ago   Up About an hour   0.0.0.0:8080->8080/tcp, [::]:8080->8080/tcp
socialnetwork-post-storage-memcached-1   memcached                                            "docker-entrypoint.s…"   post-storage-memcached   11 hours ago   Up About an hour   11211/tcp
socialnetwork-post-storage-mongodb-1     mongo:4.4.6                                          "docker-entrypoint.s…"   post-storage-mongodb     11 hours ago   Up About an hour   27017/tcp
socialnetwork-post-storage-service-1     deathstarbench/social-network-microservices:latest   "PostStorageService"     post-storage-service     11 hours ago   Up About an hour   0.0.0.0:10002->9090/tcp, [::]:10002->9090/tcp
socialnetwork-social-graph-mongodb-1     mongo:4.4.6                                          "docker-entrypoint.s…"   social-graph-mongodb     11 hours ago   Up About an hour   27017/tcp
socialnetwork-social-graph-redis-1       redis                                                "docker-entrypoint.s…"   social-graph-redis       11 hours ago   Up About an hour   6379/tcp
socialnetwork-social-graph-service-1     deathstarbench/social-network-microservices:latest   "SocialGraphService"     social-graph-service     11 hours ago   Up About an hour   
socialnetwork-text-service-1             deathstarbench/social-network-microservices:latest   "TextService"            text-service             11 hours ago   Up About an hour   
socialnetwork-unique-id-service-1        deathstarbench/social-network-microservices:latest   "UniqueIdService"        unique-id-service        11 hours ago   Up About an hour   
socialnetwork-url-shorten-memcached-1    memcached                                            "docker-entrypoint.s…"   url-shorten-memcached    11 hours ago   Up About an hour   11211/tcp
socialnetwork-url-shorten-mongodb-1      mongo:4.4.6                                          "docker-entrypoint.s…"   url-shorten-mongodb      11 hours ago   Up About an hour   27017/tcp
socialnetwork-url-shorten-service-1      deathstarbench/social-network-microservices:latest   "UrlShortenService"      url-shorten-service      11 hours ago   Up About an hour   
socialnetwork-user-memcached-1           memcached                                            "docker-entrypoint.s…"   user-memcached           11 hours ago   Up About an hour   11211/tcp
socialnetwork-user-mention-service-1     deathstarbench/social-network-microservices:latest   "UserMentionService"     user-mention-service     11 hours ago   Up About an hour   
socialnetwork-user-mongodb-1             mongo:4.4.6                                          "docker-entrypoint.s…"   user-mongodb             11 hours ago   Up About an hour   27017/tcp
socialnetwork-user-service-1             deathstarbench/social-network-microservices:latest   "UserService"            user-service             11 hours ago   Up About an hour   
socialnetwork-user-timeline-mongodb-1    mongo:4.4.6                                          "docker-entrypoint.s…"   user-timeline-mongodb    11 hours ago   Up About an hour   27017/tcp
socialnetwork-user-timeline-redis-1      redis                                                "docker-entrypoint.s…"   user-timeline-redis      11 hours ago   Up About an hour   6379/tcp
socialnetwork-user-timeline-service-1    deathstarbench/social-network-microservices:latest   "UserTimelineService"    user-timeline-service    11 hours ago   Up About an hour